Service - Employment/samples/RetrieveList.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:emp="https://services.ird.govt.nz/GWS/Employment/" xmlns:ret="https://services.ird.govt.nz/GWS/Employment/:types/RetrieveListRequest">
   <soap:Header>
      <a:To>http://localhost/WebServices/Gateway/GWS/Employment</a:To>
      <a:Action>https://services.ird.govt.nz/GWS/Employment/Employment/RetrieveList</a:Action>
   </soap:Header>
   <soap:Body>
      <emp:RetrieveList>
         <emp:RetrieveListRequestMsg>
            <ret:RetrieveListRequestWrapper>
               <!--You may enter ANY elements at this point-->
               <empl:retrieveListRequest xmlns:empl="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v1">
                  <empl:header>
                     <cmn:softwareProviderData>
                        <cmn:softwareProvider>Provider</cmn:softwareProvider>
                        <cmn:softwarePlatform>Platform</cmn:softwarePlatform>
                        <cmn:softwareRelease>Release</cmn:softwareRelease>
                     </cmn:softwareProviderData>
                     <cmn:identifier IdentifierValueType="ACCIRD">123009916</cmn:identifier>
                  </empl:header>
               </empl:retrieveListRequest>
            </ret:RetrieveListRequestWrapper>
         </emp:RetrieveListRequestMsg>
      </emp:RetrieveList>
   </soap:Body>
</soap:Envelope>
